###########################################################
#
#  Create Synopsys Reports
#  Author: Randy Zamor R
#
###########################################################

report_power > ../reports/power.txt
report_area > ../reports/area.txt
report_cell > ../reports/cell.txt
report_qor > ../reports/qor.txt
report_timing > ../reports/timing.txt

##########################################################
